<script setup>
import { useRouter } from "vue-router";

const router = useRouter();
const btnPrevStep = () => {
  router.push("/join");
};
const btnNextStep = () => {
  router.push("/join_form");
};
</script>
<script>
export default {
  data() {
    return {
      checkedItems: {
        termsAgree1: false,
        termsAgree2: false,
        termsAgree3: false,
        termsAgree4: false,
        termsAgree5: false,
        termsAgree6: false,
      },
    };
  },
  methods: {
    checkAll(event) {
      const isChecked = event.target.checked;

      // "termsAgree"로 시작하는 모든 체크박스 상태 변경
      Object.keys(this.checkedItems).forEach((key) => {
        if (key.startsWith("termsAgree")) {
          this.checkedItems[key] = isChecked;
        }
      });
    },
  },
};
</script>
<template>
  <div class="container">
    <div class="main">
      <div class="member_tit">
        <ol>
          <li class="page_on">
            <span>01</span> 약관동의<img
              src="../../assets/icons/icon_join_step_off.png"
              alt=""
            />
          </li>
          <li>
            <span>02</span> 정보입력<img
              src="../../assets/icons/icon_join_step_off.png"
              alt=""
            />
          </li>
          <li><span>03</span> 가입완료</li>
        </ol>
      </div>
      <div class="member_tit2">
        <p><span class="txt_mainco">Eatzzy</span> 약관동의</p>
      </div>
      <div class="member_cont">
        <div class="join_agreement_cont">
          <label class="check" for="allAgree">
            <div class="join_agreement_box agree_all">
              <div class="form_element">
                <input type="checkbox" id="allAgree" @change="checkAll" />
                <label class="check" for="allAgree">
                  <em
                    >Eatzzy의 모든 약관을 확인하고 전체 동의합니다.&nbsp;</em
                  ></label
                >
              </div>
            </div>
          </label>
          <!-- //join_agreement_box -->

          <div class="join_agreebox_wrap">
            <div class="agree_left">
              <div class="join_agreement_box js_terms_view">
                <div class="form_element">
                  <input
                    type="checkbox"
                    id="termsAgree1"
                    name="agreementInfoFl"
                    class="require"
                    v-model="checkedItems.termsAgree1"
                  />
                  <label class="check_s" for="termsAgree1"
                    >이용약관 <strong>(필수)</strong></label
                  >
                </div>
                <div
                  class="agreement_box"
                  id="agreementInfo_box"
                  style="display: block"
                >
                  <div class="agree_wrap">
                    <div class="agree_tit"><h3>이용약관</h3></div>
                    <div class="agree_index">
                      <div class="index-line"></div>
                      <div class="dl1">
                        <p class="dt"><a href="#ag_01">제1조 목적</a></p>
                        <p class="dt"><a href="#ag_02">제2조 정의</a></p>
                        <p class="dt">
                          <a href="#ag_03"
                            >제3조 약관 등의 명시와 설명 및 개정</a
                          >
                        </p>
                        <p class="dt">
                          <a href="#ag_04">제4조 서비스의 제공 및 변경</a>
                        </p>
                        <p class="dt">
                          <a href="#ag_05">제5조 서비스의 중단</a>
                        </p>
                        <p class="dt">
                          <a href="#ag_06">제6조 회원가입</a>
                        </p>
                        <p class="dt">
                          <a href="#ag_07">제7조 회원 탈퇴 및 자격 상실 등</a>
                        </p>
                        <p class="dt">
                          <a href="#ag_08">제8조 회원에 대한 통지</a>
                        </p>
                        <p class="dt">
                          <a href="#ag_09">제9조 구매신청</a>
                        </p>
                        <p class="dt">
                          <a href="#ag_10">제10조 계약의 성립</a>
                        </p>
                      </div>
                      <div class="dl2">
                        <p class="dt">
                          <a href="#ag_11">제11조 지급방법</a>
                        </p>
                        <p class="dt">
                          <a href="#ag_12"
                            >제12조 수신확인통지, 구매신청 변경 및 취소</a
                          >
                        </p>
                        <p class="dt">
                          <a href="#ag_13">제13조 재화 등의 공급</a>
                        </p>
                        <p class="dt"><a href="#ag_14">제14조 환급</a></p>
                        <p class="dt">
                          <a href="#ag_15">제15조 청약철회 등</a>
                        </p>
                        <p class="dt">
                          <a href="#ag_16">제16조 청약철회 등의 효과</a>
                        </p>
                        <p class="dt">
                          <a href="#ag_17">제17조 개인정보보호</a>
                        </p>
                        <p class="dt">
                          <a href="#ag_18">제18조 "몰"의 의무</a>
                        </p>
                        <p class="dt">
                          <a href="#ag_19"
                            >제19조 회원의 ID 및 비밀번호에 대한 의무</a
                          >
                        </p>
                        <p class="dt">
                          <a href="#ag_20">제20조 이용자의 의무</a>
                        </p>
                      </div>
                      <div class="dl3">
                        <p class="dt">
                          <a href="#ag_21"
                            >제21조 연결"몰"과 피연결"몰"간의 관계</a
                          >
                        </p>
                        <p class="dt">
                          <a href="#ag_22">제22조 저작권의 귀속 및 이용제한</a>
                        </p>
                        <p class="dt">
                          <a href="#ag_23">제23조 분쟁해결</a>
                        </p>
                        <p class="dt">
                          <a href="#ag_24">제24조 재판권 및 준거법</a>
                        </p>
                        <p class="dt">
                          <a href="#ag_25"
                            >제25조 카카오알림톡 시행에 관한 사항</a
                          >
                        </p>
                        <p class="dt">
                          <a href="#ag_26">제26조 적립금(마일리지)</a>
                        </p>
                        <p class="dt">
                          <a href="#ag_27">제27조 할인쿠폰</a>
                        </p>
                        <p class="dt">
                          <a href="#ag_28">제28조 면책조항</a>
                        </p>
                        <p class="dt">
                          <a href="#ag_29">제29조 위탁판매 금지조항(신설)</a>
                        </p>
                      </div>
                      <div class="index-line"></div>
                    </div>
                    <div id="ag_01" class="agree_section">
                      <div class="sec_tit">제1조 목적</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            이 약관은 Eatzzy(전자상거래 사업자)가 운영하는
                            Eatzzy(이하 “몰”이라 한다)에서 제공하는 인터넷 관련
                            서비스(이하 “서비스”라 한다)를 이용함에 있어 사이버
                            몰과 이용자의 권리․의무 및 책임사항을 규정함을
                            목적으로 합니다.
                          </li>
                          <li>
                            ※「PC통신, 무선 등을 이용하는 전자상거래에 대해서도
                            그 성질에 반하지 않는 한 이 약관을 준용합니다.」
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_02" class="agree_section">
                      <div class="sec_tit">제2조 정의</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰”이란 OO회사가 재화 또는 용역(이하 “재화 등”이라
                            함)을 이용자에게 제공하기 위하여 컴퓨터 등
                            정보통신설비를 이용하여 재화 등을 거래할 수 있도록
                            설정한 가상의 영업장을 말하며, 아울러 사이버몰을
                            운영하는 사업자의 의미로도 사용합니다.
                          </li>
                          <li>
                            “이용자”란 “몰”에 접속하여 이 약관에 따라 “몰”이
                            제공하는 서비스를 받는 회원 및 비회원을 말합니다.
                          </li>
                          <li>
                            ‘회원’이라 함은 “몰”에 (삭제) 회원등록을 한 자로서,
                            계속적으로 “몰”이 제공하는 서비스를 이용할 수 있는
                            자를 말합니다.
                          </li>
                          <li>
                            ‘비회원’이라 함은 회원에 가입하지 않고 “몰”이
                            제공하는 서비스를 이용하는 자를 말합니다.
                          </li>
                          <li>
                            ‘휴면회원’이라 함은 ‘몰’의 ‘회원’중 1년이상 서비스
                            이용기록이 없는 자를 말합니다. 휴면회원은 ‘몰’의
                            정책에 따라 서비스 이용이 제한 될 수 있으며, 다시
                            서비스를 이용하기 위하여는 거래 안전 등을 위하여
                            ‘몰’이 정하는 본인확인 절차 또는 로그인을 통하여
                            ‘회원’의 서비스를 이용할 수 있습니다.
                          </li>
                        </ol>
                        <strong></strong>
                      </div>
                    </div>
                    <div id="ag_03" class="agree_section">
                      <div class="sec_tit">
                        제3조 약관 등의 명시와 설명 및 개정
                      </div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰”은 이 약관의 내용과 상호 및 대표자 성명, 영업소
                            소재지 주소(소비자의 불만을 처리할 수 있는 곳의
                            주소를 포함),
                            전화번호․모사전송번호․전자우편주소,사업자등록번호,
                            통신판매업 신고번호, 개인정보관리책임자등을 이용자가
                            쉽게 알 수 있도록 00사이버몰의 초기
                            서비스화면(전면)에 게시합니다. 다만, 약관의 내용은
                            이용자가 연결화면을 통하여 볼 수 있도록 할 수
                            있습니다.
                          </li>
                          <li>
                            “몰”은 이용자가 약관에 동의하기에 앞서 약관에
                            정하여져 있는 내용 중 청약철회․배송책임․환불조건
                            등과 같은 중요한 내용을 이용자가 이해할 수 있도록
                            별도의 연결화면 또는 팝업화면 등을 제공하여 이용자의
                            확인을 구하여야 합니다.
                          </li>
                          <li>
                            “몰”은 「전자상거래 등에서의 소비자보호에 관한
                            법률」, 「약관의 규제에 관한 법률」, 「전자문서 및
                            전자거래기본법」, 「전자금융거래법」,
                            「전자서명법」, 「정보통신망 이용촉진 및 정보보호
                            등에 관한 법률」, 「방문판매 등에 관한 법률」,
                            「소비자기본법」 등 관련 법을 위배하지 않는 범위에서
                            이 약관을 개정할 수 있습니다.
                          </li>
                          <li>
                            “몰”이 약관을 개정할 경우에는 적용일자 및 개정사유를
                            명시하여 현행약관과 함께 몰의 초기화면에 그 적용일자
                            7일 이전부터 적용일자 전일까지 공지합니다. 다만,
                            이용자에게 불리하게 약관내용을 변경하는 경우에는
                            최소한 30일 이상의 사전 유예기간을 두고 공지합니다.
                            이 경우 "몰“은 개정 전 내용과 개정 후 내용을
                            명확하게 비교하여 이용자가 알기 쉽도록 표시합니다.
                          </li>
                          <li>
                            “몰”이 약관을 개정할 경우에는 그 개정약관은 그
                            적용일자 이후에 체결되는 계약에만 적용되고 그 이전에
                            이미 체결된 계약에 대해서는 개정 전의 약관조항이
                            그대로 적용됩니다. 다만 이미 계약을 체결한 이용자가
                            개정약관 조항의 적용을 받기를 원하는 뜻을 제3항에
                            의한 개정약관의 공지기간 내에 “몰”에 송신하여 “몰”의
                            동의를 받은 경우에는 개정약관 조항이 적용됩니다.
                          </li>
                          <li>
                            이 약관에서 정하지 아니한 사항과 이 약관의 해석에
                            관하여는 전자상거래 등에서의 소비자보호에 관한 법률,
                            약관의 규제 등에 관한 법률, 공정거래위원회가 정하는
                            전자상거래 등에서의 소비자 보호지침 및 관계법령 또는
                            상관례에 따릅니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_04" class="agree_section">
                      <div class="sec_tit">제4조 서비스의 제공 및 변경</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰”은 다음과 같은 업무를 수행합니다.
                            <ul class="circlednum_type">
                              <li>
                                ① 재화 또는 용역에 대한 정보 제공 및 구매계약의
                                체결
                              </li>
                              <li>② 구매계약이 체결된 재화 또는 용역의 배송</li>
                              <li>③ 기타 “몰”이 정하는 업무</li>
                            </ul>
                          </li>
                          <li>
                            “몰”은 재화 또는 용역의 품절 또는 기술적 사양의 변경
                            등의 경우에는 장차 체결되는 계약에 의해 제공할 재화
                            또는 용역의 내용을 변경할 수 있습니다. 이 경우에는
                            변경된 재화 또는 용역의 내용 및 제공일자를 명시하여
                            현재의 재화 또는 용역의 내용을 게시한 곳에 즉시
                            공지합니다.
                          </li>
                          <li>
                            “몰”이 제공하기로 이용자와 계약을 체결한 서비스의
                            내용을 재화등의 품절 또는 기술적 사양의 변경 등의
                            사유로 변경할 경우에는 그 사유를 이용자에게 통지
                            가능한 주소로 즉시 통지합니다.
                          </li>
                          <li>
                            전항의 경우 “몰”은 이로 인하여 이용자가 입은 손해를
                            배상합니다. 다만, “몰”이 고의 또는 과실이 없음을
                            입증하는 경우에는 그러하지 아니합니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_05" class="agree_section">
                      <div class="sec_tit">제5조 서비스의 중단</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰”은 컴퓨터 등 정보통신설비의 보수점검․교체 및
                            고장, 통신의 두절 등의 사유가 발생한 경우에는
                            서비스의 제공을 일시적으로 중단할 수 있습니다.
                          </li>
                          <li>
                            “몰”은 제1항의 사유로 서비스의 제공이 일시적으로
                            중단됨으로 인하여 이용자 또는 제3자가 입은 손해에
                            대하여 배상합니다. 단, “몰”이 고의 또는 과실이
                            없음을 입증하는 경우에는 그러하지 아니합니다.
                          </li>
                          <li>
                            사업종목의 전환, 사업의 포기, 업체 간의 통합 등의
                            이유로 서비스를 제공할 수 없게 되는 경우에는 “몰”은
                            제8조에 정한 방법으로 이용자에게 통지하고 당초
                            “몰”에서 제시한 조건에 따라 소비자에게 보상합니다.
                            다만, “몰”이 보상기준 등을 고지하지 아니한 경우에는
                            이용자들의 마일리지 또는 적립금 등을 “몰”에서
                            통용되는 통화가치에 상응하는 현물 또는 현금으로
                            이용자에게 지급합니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_06" class="agree_section">
                      <div class="sec_tit">제6조 회원가입</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            이용자는 “몰”이 정한 가입 양식에 따라 회원정보를
                            기입한 후 이 약관에 동의한다는 의사표시를 함으로서
                            회원가입을 신청합니다.
                          </li>
                          <li>
                            “몰”은 제1항과 같이 회원으로 가입할 것을 신청한
                            이용자 중 다음 각 호에 해당하지 않는 한 회원으로
                            등록합니다.
                            <ul class="circlednum_type">
                              <li>
                                ① 가입신청자가 이 약관 제7조제3항에 의하여
                                이전에 회원자격을 상실한 적이 있는 경우, 다만
                                제7조제3항에 의한 회원자격 상실 후 3년이 경과한
                                자로서 “몰”의 회원재가입 승낙을 얻은 경우에는
                                예외로 한다.
                              </li>
                              <li>
                                ② 등록 내용에 허위, 기재누락, 오기가 있는 경우
                              </li>
                              <li>
                                ③ 기타 회원으로 등록하는 것이 “몰”의 기술상
                                현저히 지장이 있다고 판단되는 경우
                              </li>
                            </ul>
                          </li>
                          <li>
                            회원가입계약의 성립 시기는 “몰”의 승낙이 회원에게
                            도달한 시점으로 합니다.
                          </li>
                          <li>
                            회원은 회원가입 시 등록한 사항에 변경이 있는 경우,
                            상당한 기간 이내에 “몰”에 대하여 회원정보 수정 등의
                            방법으로 그 변경사항을 알려야 합니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_07" class="agree_section">
                      <div class="sec_tit">제7조 회원 탈퇴 및 자격 상실 등</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            회원은 “몰”에 언제든지 탈퇴를 요청할 수 있으며
                            “몰”은 즉시 회원탈퇴를 처리합니다.
                          </li>
                          <li>
                            회원이 다음 각 호의 사유에 해당하는 경우, “몰”은
                            회원자격을 제한 및 정지시킬 수 있습니다.
                            <ul class="circlednum_type">
                              <li>① 가입 신청 시에 허위 내용을 등록한 경우</li>
                              <li>
                                ② “몰”을 이용하여 구입한 재화 등의 대금, 기타
                                “몰”이용에 관련하여 회원이 부담하는 채무를
                                기일에 지급하지 않는 경우
                              </li>
                              <li>
                                ③ 다른 사람의 “몰” 이용을 방해하거나 그 정보를
                                도용하는 등 전자상거래 질서를 위협하는 경우
                              </li>
                              <li>
                                ④ “몰”을 이용하여 법령 또는 이 약관이 금지하거나
                                공서양속에 반하는 행위를 하는 경우
                              </li>
                              <li>
                                ⑤ 기타 다음과 같은 행위 등으로 ‘몰’의 건전한
                                운영을 해하거나 업무를 방해하는 경우<br />
                                <ul style="padding: 0 0 0 16px">
                                  <br />
                                  <li>
                                    가. “몰”의 운영과 관련하여 근거 없는 사실
                                    또는 허위의 사실을 적시하거나 유포하여
                                    “몰”의 명예를 실추시키거나 “몰”의 신뢰성을
                                    해하는 경우
                                  </li>
                                  <br />
                                  <li>
                                    나. “몰”의 이용과정에서 직원에게 폭언, 협박
                                    또는 음란한 언행으로 “몰”의 운영을 방해하는
                                    경우
                                  </li>
                                  <br />
                                  <li>
                                    다. “몰”을 통해 재화 등을 구매한 후 정당한
                                    이유 없이 상습 또는 반복적으로 취소 반품하여
                                    “몰”의 업무를 방해하는 경우
                                  </li>
                                  <br />
                                </ul>
                                <br />
                              </li>
                              <li>
                                ⑥ 비정상적 경로 및/또는 부정한 방법을 통해
                                가입한 것으로 판명된 경우
                              </li>
                            </ul>
                          </li>
                          <li>
                            “몰”이 회원 자격을 제한․정지 시킨 후, 동일한 행위가
                            2회 이상 반복되거나 30일 이내에 그 사유가 시정되지
                            아니하는 경우 “몰”은 회원자격을 상실시킬 수
                            있습니다.
                          </li>
                          <li>
                            “몰”이 회원자격을 상실시키는 경우에는 회원등록을
                            말소합니다. 이 경우 회원에게 이를 통지하고, 회원등록
                            말소 전에 최소한 30일 이상의 기간을 정하여 소명할
                            기회를 부여합니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_08" class="agree_section">
                      <div class="sec_tit">제8조 회원에 대한 통지</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰”이 회원에 대한 통지를 하는 경우, 회원정보를
                            기준으로 하여 회원이 지정한 SMS 수신번호 또는
                            전자우편 주소 등으로 할 수 있습니다.
                          </li>
                          <li>
                            “몰”은 불특정다수 회원에 대한 통지의 경우 1주일이상
                            “몰” 게시판에 게시함으로서 개별 통지에 갈음할 수
                            있습니다. 다만, 회원 본인의 거래와 관련하여 중대한
                            영향을 미치는 사항에 대하여는 개별통지를 합니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_09" class="agree_section">
                      <div class="sec_tit">제9조 구매신청</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰”이용자는 “몰”상에서 다음 또는 이와 유사한 방법에
                            의하여 구매를 신청하며, “몰”은 이용자가 구매신청을
                            함에 있어서 다음의 각 내용을 알기 쉽게 제공하여야
                            합니다. (삭제)
                            <ul class="circlednum_type">
                              <li>① 재화 등의 검색 및 선택</li>
                              <li>
                                ② 받는 사람의 성명, 주소, 전화번호,
                                전자우편주소(또는 이동전화번호) 등의 입력
                              </li>
                              <li>
                                ③ 약관내용, 청약철회권이 제한되는 서비스,
                                배송료․설치비 등의 비용부담과 관련한 내용에 대한
                                확인
                              </li>
                              <li>
                                ④ 이 약관에 동의하고 위 3.호의 사항을 확인하거나
                                거부하는 표시(예, 마우스 클릭)
                              </li>
                              <li>
                                ⑤ 재화등의 구매신청 및 이에 관한 확인 또는
                                “몰”의 확인에 대한 동의
                              </li>
                              <li>⑥ 결제방법의 선택</li>
                            </ul>
                          </li>
                          <li>
                            “몰”이 제3자에게 구매자 개인정보를 제공•위탁할
                            필요가 있는 경우 실제 구매신청 시 구매자의 동의를
                            받아야 하며, 회원가입 시 미리 포괄적으로 동의를 받지
                            않습니다. 이 때 “몰”은 제공되는 개인정보 항목,
                            제공받는 자, 제공받는 자의 개인정보 이용 목적 및
                            보유‧이용 기간 등을 구매자에게 명시하여야 합니다.
                            다만 「정보통신망이용촉진 및 정보보호 등에 관한
                            법률」 제25조 제1항에 의한 개인정보 취급위탁의 경우
                            등 관련 법령에 달리 정함이 있는 경우에는 그에
                            따릅니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_10" class="agree_section">
                      <div class="sec_tit">제10조 계약의 성립</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰”은 제9조와 같은 구매신청에 대하여 다음 각 호에
                            해당하면 승낙하지 않을 수 있습니다. 다만, 미성년자와
                            계약을 체결하는 경우에는 법정대리인의 동의를 얻지
                            못하면 미성년자 본인 또는 법정대리인이 계약을 취소할
                            수 있다는 내용을 고지하여야 합니다.
                            <ul class="circlednum_type">
                              <li>
                                ① 신청 내용에 허위, 기재누락, 오기가 있는 경우
                              </li>
                              <li>
                                ② 미성년자가 담배, 주류 등 청소년보호법에서
                                금지하는 재화 및 용역을 구매하는 경우
                              </li>
                              <li>
                                ③ 기타 구매신청에 승낙하는 것이 “몰” 기술상
                                현저히 지장이 있다고 판단하는 경우
                              </li>
                              <li>
                                ④ 구매신청 고객이 제 7조에 따른 회원자격이
                                제한•정지 또는 상실된 회원으로 확인되었을 경우
                              </li>
                            </ul>
                          </li>
                          <li>
                            “몰”의 승낙이 제12조제1항의 수신확인통지형태로
                            이용자에게 도달한 시점에 계약이 성립한 것으로
                            봅니다.
                          </li>
                          <li>
                            “몰”의 승낙의 의사표시에는 이용자의 구매 신청에 대한
                            확인 및 판매가능 여부, 구매신청의 정정 취소 등에
                            관한 정보 등을 포함하여야 합니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_11" class="agree_section">
                      <div class="sec_tit">제11조 지급방법</div>
                      <div class="sec_box">
                        <ol class="sec_txt" style="padding-left: 0">
                          <li class="list_no">
                            “몰”에서 구매한 재화 또는 용역에 대한 대금지급방법은
                            다음 각 호의 방법중 가용한 방법으로 할 수 있습니다.
                            단, “몰”은 이용자의 지급방법에 대하여 재화 등의
                            대금에 어떠한 명목의 수수료도 추가하여 징수할 수
                            없습니다.
                            <ul
                              class="circlednum_type"
                              style="padding-left: 28px; text-indent: -15px"
                            >
                              <li>
                                ① 폰뱅킹, 인터넷뱅킹, 메일 뱅킹 등의 각종
                                계좌이체
                              </li>
                              <li>
                                ② 선불카드, 직불카드, 신용카드 등의 각종 카드
                                결제
                              </li>
                              <li>③ 온라인무통장입금</li>
                              <li>④ 전자화폐에 의한 결제</li>
                              <li>⑤ 수령 시 대금지급</li>
                              <li>
                                ⑥ 마일리지 등 “몰”이 지급한 포인트에 의한 결제
                              </li>
                              <li>
                                ⑦ “몰”과 계약을 맺었거나 “몰”이 인정한 상품권에
                                의한 결제
                              </li>
                              <li>
                                ⑧ 기타 전자적 지급 방법에 의한 대금 지급 등
                              </li>
                            </ul>
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_12" class="agree_section">
                      <div class="sec_tit">
                        제12조 수신확인 통지, 구매신청 변경 및 취소
                      </div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰”은 이용자의 구매신청이 있는 경우 이용자에게
                            수신확인통지를 합니다.
                          </li>
                          <li>
                            수신확인통지를 받은 이용자는 의사표시의 불일치 등이
                            있는 경우에는 수신확인통지를 받은 후 즉시 구매신청
                            변경 및 취소를 요청할 수 있고 “몰”은 배송 전에
                            이용자의 요청이 있는 경우에는 지체 없이 그 요청에
                            따라 처리하여야 합니다. 다만 이미 대금을 지불한
                            경우에는 제15조의 청약철회 등에 관한 규정에
                            따릅니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_13" class="agree_section">
                      <div class="sec_tit">제13조 재화 등의 공급</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰”은 이용자와 재화 등의 공급시기에 관하여 별도의
                            약정이 없는 이상, 이용자가 청약을 한 날부터 7일
                            이내에 재화 등을 배송할 수 있도록 주문제작, 포장 등
                            기타의 필요한 조치를 취합니다. 다만, “몰”이 이미
                            재화 등의 대금의 전부 또는 일부를 받은 경우에는
                            대금의 전부 또는 일부를 받은 날부터 3영업일 이내에
                            조치를 취합니다. 이때 “몰”은 이용자가 재화 등의 공급
                            절차 및 진행 사항을 확인할 수 있도록 적절한 조치를
                            합니다.
                          </li>
                          <li>
                            “몰”은 이용자가 구매한 재화에 대해 배송수단, 수단별
                            배송비용 부담자, 수단별 배송기간 등을 명시합니다.
                            만약 “몰”이 약정 배송기간을 초과한 경우에는 그로
                            인한 이용자의 손해를 배상하여야 합니다. 다만 “몰”이
                            고의․과실이 없음을 입증한 경우에는 그러하지
                            아니합니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_14" class="agree_section">
                      <div class="sec_tit">제14조 환급</div>
                      <div class="sec_box">
                        <ol class="sec_txt" style="padding-left: 0">
                          <li class="list_no">
                            “몰”은 이용자가 구매신청한 재화 등이 품절 등의
                            사유로 인도 또는 제공을 할 수 없을 때에는 지체 없이
                            그 사유를 이용자에게 통지하고 사전에 재화 등의
                            대금을 받은 경우에는 대금을 받은 날부터 3영업일
                            이내에 환급하거나 환급에 필요한 조치를 취합니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_15" class="agree_section">
                      <div class="sec_tit">제15조 청약철회 등</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰”과 재화등의 구매에 관한 계약을 체결한 이용자는
                            「전자상거래 등에서의 소비자보호에 관한 법률」
                            제13조 제2항에 따른 계약내용에 관한 서면을 받은
                            날(그 서면을 받은 때보다 재화 등의 공급이 늦게
                            이루어진 경우에는 재화 등을 공급받거나 재화 등의
                            공급이 시작된 날을 말합니다)부터 7일 이내에는 청약의
                            철회를 할 수 있습니다. 다만, 청약철회에 관하여
                            「전자상거래 등에서의 소비자보호에 관한 법률」에
                            달리 정함이 있는 경우에는 동 법 규정에 따릅니다.
                          </li>
                          <li>
                            이용자는 재화 등을 배송 받은 경우 다음 각 호의 1에
                            해당하는 경우에는 반품 및 교환을 할 수 없습니다.
                            <ul class="circlednum_type">
                              <li>
                                ① 이용자에게 책임 있는 사유로 재화 등이 멸실
                                또는 훼손된 경우<br />(다만, 재화 등의 내용을
                                확인하기 위하여 포장 등을 훼손한 경우에는
                                청약철회를 할 수 있습니다)
                              </li>
                              <li>
                                ② 이용자의 사용 또는 일부 소비에 의하여 재화
                                등의 가치가 현저히 감소한 경우
                              </li>
                              <li>
                                ③ 시간의 경과에 의하여 재판매가 곤란할 정도로
                                재화등의 가치가 현저히 감소한 경우
                              </li>
                              <li>
                                ④ 같은 성능을 지닌 재화 등으로 복제가 가능한
                                경우 그 원본인 재화 등의 포장을 훼손한 경우
                              </li>
                            </ul>
                          </li>
                          <li>
                            제2항 제2호 내지 제4호의 경우에 “몰”이 사전에
                            청약철회 등이 제한되는 사실을 소비자가 쉽게 알 수
                            있는 곳에 명기하거나 시용상품을 제공하는 등의 조치를
                            하지 않았다면 이용자의 청약철회 등이 제한되지
                            않습니다.
                          </li>
                          <li>
                            이용자는 제1항 및 제2항의 규정에 불구하고 재화 등의
                            내용이 표시•광고 내용과 다르거나 계약내용과 다르게
                            이행된 때에는 당해 재화 등을 공급받은 날부터 3월
                            이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일
                            이내에 청약철회 등을 할 수 있습니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_16" class="agree_section">
                      <div class="sec_tit">제16조 청약철회 등의 효과</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰”은 이용자로부터 재화 등을 반환받은 경우 3영업일
                            이내에 이미 지급받은 재화 등의 대금을 환급합니다. 이
                            경우 “몰”이 이용자에게 재화등의 환급을 지연한때에는
                            그 지연기간에 대하여 「전자상거래 등에서의
                            소비자보호에 관한 법률 시행령」제21조의2에서 정하는
                            지연이자율(괄호 부분 삭제)을 곱하여 산정한
                            지연이자를 지급합니다.
                          </li>
                          <li>
                            “몰”은 위 대금을 환급함에 있어서 이용자가 신용카드
                            또는 전자화폐 등의 결제수단으로 재화 등의 대금을
                            지급한 때에는 지체 없이 당해 결제수단을 제공한
                            사업자로 하여금 재화 등의 대금의 청구를 정지 또는
                            취소하도록 요청합니다.
                          </li>
                          <li>
                            청약철회 등의 경우 공급받은 재화 등의 반환에 필요한
                            비용은 이용자가 부담합니다. “몰”은 이용자에게
                            청약철회 등을 이유로 위약금 또는 손해배상을 청구하지
                            않습니다. 다만 재화 등의 내용이 표시•광고 내용과
                            다르거나 계약내용과 다르게 이행되어 청약철회 등을
                            하는 경우 재화 등의 반환에 필요한 비용은 “몰”이
                            부담합니다.
                          </li>
                          <li>
                            이용자가 재화 등을 제공받을 때 발송비를 부담한
                            경우에 “몰”은 청약철회 시 그 비용을 누가
                            부담하는지를 이용자가 알기 쉽도록 명확하게
                            표시합니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_17" class="agree_section">
                      <div class="sec_tit">제17조 개인정보보호</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰”은 이용자의 개인정보 수집시 서비스제공을 위하여
                            필요한 범위에서 최소한의 개인정보를 수집합니다.
                          </li>
                          <li>
                            “몰”은 회원가입시 구매계약이행에 필요한 정보를 미리
                            수집하지 않습니다. 다만, 관련 법령상 의무이행을
                            위하여 구매계약 이전에 본인확인이 필요한 경우로서
                            최소한의 특정 개인정보를 수집하는 경우에는 그러하지
                            아니합니다.
                          </li>
                          <li>
                            “몰”은 이용자의 개인정보를 수집•이용하는 때에는 당해
                            이용자에게 그 목적을 고지하고 동의를 받습니다.
                          </li>
                          <li>
                            “몰”은 수집된 개인정보를 목적외의 용도로 이용할 수
                            없으며, 새로운 이용목적이 발생한 경우 또는 제3자에게
                            제공하는 경우에는 이용•제공단계에서 당해 이용자에게
                            그 목적을 고지하고 동의를 받습니다. 다만, 관련
                            법령에 달리 정함이 있는 경우에는 예외로 합니다.
                          </li>
                          <li>
                            “몰”이 제2항과 제3항에 의해 이용자의 동의를 받아야
                            하는 경우에는 개인정보관리 책임자의 신원(소속, 성명
                            및 전화번호, 기타 연락처), 정보의 수집목적 및
                            이용목적, 제3자에 대한 정보제공 관련사항(제공받은자,
                            제공목적 및 제공할 정보의 내용) 등 「정보통신망
                            이용촉진 및 정보보호 등에 관한 법률」 제22조제2항이
                            규정한 사항을 미리 명시하거나 고지해야 하며 이용자는
                            언제든지 이 동의를 철회할 수 있습니다.
                          </li>
                          <li>
                            이용자는 언제든지 “몰”이 가지고 있는 자신의
                            개인정보에 대해 열람 및 오류정정을 요구할 수 있으며
                            “몰”은 이에 대해 지체 없이 필요한 조치를 취할 의무를
                            집니다. 이용자가 오류의 정정을 요구한 경우에는
                            “몰”은 그 오류를 정정할 때까지 당해 개인정보를
                            이용하지 않습니다.
                          </li>
                          <li>
                            “몰”은 개인정보 보호를 위하여 이용자의 개인정보를
                            취급하는 자를 최소한으로 제한하여야 하며 신용카드,
                            은행계좌 등을 포함한 이용자의 개인정보의 분실, 도난,
                            유출, 동의 없는 제3자 제공, 변조 등으로 인한
                            이용자의 손해에 대하여 모든 책임을 집니다.
                          </li>
                          <li>
                            “몰” 또는 그로부터 개인정보를 제공받은 제3자는
                            개인정보의 수집목적 또는 제공받은 목적을 달성한
                            때에는 당해 개인정보를 지체 없이 파기합니다.
                          </li>
                          <li>
                            “몰”은 개인정보의 수집•이용•제공에 관한 동의란을
                            미리 선택한 것으로 설정해두지 않습니다. 또한
                            개인정보의 수집•이용•제공에 관한 이용자의 동의거절시
                            제한되는 서비스를 구체적으로 명시하고,
                            필수수집항목이 아닌 개인정보의 수집•이용•제공에 관한
                            이용자의 동의 거절을 이유로 회원가입 등 서비스
                            제공을 제한하거나 거절하지 않습니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_18" class="agree_section">
                      <div class="sec_tit">제18조 “몰“의 의무</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰”은 법령과 이 약관이 금지하거나 공서양속에 반하는
                            행위를 하지 않으며 이 약관이 정하는 바에 따라
                            지속적이고, 안정적으로 재화․용역을 제공하는데 최선을
                            다하여야 합니다.
                          </li>
                          <li>
                            “몰”은 이용자가 안전하게 인터넷 서비스를 이용할 수
                            있도록 이용자의 개인정보(신용정보 포함)보호를 위한
                            보안 시스템을 갖추어야 합니다.
                          </li>
                          <li>
                            “몰”이 상품이나 용역에 대하여 「표시․광고의 공정화에
                            관한 법률」 제3조 소정의 부당한 표시․광고행위를
                            함으로써 이용자가 손해를 입은 때에는 이를 배상할
                            책임을 집니다.
                          </li>
                          <li>
                            “몰”은 이용자가 원하지 않는 영리목적의 광고성
                            전자우편을 발송하지 않습니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_19" class="agree_section">
                      <div class="sec_tit">
                        제19조 회원의 ID 및 비밀번호에 대한 의무
                      </div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            제17조의 경우를 제외한 ID와 비밀번호에 관한
                            관리책임은 회원에게 있습니다.
                          </li>
                          <li>
                            회원은 자신의 ID 및 비밀번호를 제3자에게 이용하게
                            해서는 안됩니다.
                          </li>
                          <li>
                            회원이 자신의 ID 및 비밀번호를 도난당하거나 제3자가
                            사용하고 있음을 인지한 경우에는 바로 “몰”에 통보하고
                            “몰”의 안내가 있는 경우에는 그에 따라야 합니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_20" class="agree_section">
                      <div class="sec_tit">제20조 이용자의 의무</div>
                      <div class="sec_box">
                        <ol class="sec_txt" style="padding-left: 0">
                          <li class="list_no">
                            이용자는 다음 행위를 하여서는 안 됩니다.
                            <ul
                              class="circlednum_type"
                              style="padding-left: 28px; text-indent: -15px"
                            >
                              <li>① 신청 또는 변경시 허위 내용의 등록</li>
                              <li>② 타인의 정보 도용</li>
                              <li>③ “몰”에 게시된 정보의 변경</li>
                              <li>
                                ④ “몰”이 정한 정보 이외의 정보(컴퓨터 프로그램
                                등) 등의 송신 또는 게시
                              </li>
                              <li>
                                ⑤ “몰” 기타 제3자의 저작권 등 지적재산권에 대한
                                침해
                              </li>
                              <li>
                                ⑥ “몰” 기타 제3자의 명예를 손상시키거나 업무를
                                방해하는 행위
                              </li>
                              <li>
                                ⑦ 외설 또는 폭력적인 메시지, 화상, 음성, 기타
                                공서양속에 반하는 정보를 몰에 공개 또는 게시하는
                                행위
                              </li>
                            </ul>
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_21" class="agree_section">
                      <div class="sec_tit">
                        제21조 연결“몰”과 피연결“몰” 간의 관계
                      </div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            상위 “몰”과 하위 “몰”이 하이퍼링크(예: 하이퍼링크의
                            대상에는 문자, 그림 및 동화상 등이 포함됨)방식
                            등으로 연결된 경우, 전자를 연결 “몰”(웹
                            사이트)이라고 하고 후자를 피연결
                            “몰”(웹사이트)이라고 합니다.
                          </li>
                          <li>
                            연결“몰”은 피연결“몰”이 독자적으로 제공하는 재화
                            등에 의하여 이용자와 행하는 거래에 대해서 보증
                            책임을 지지 않는다는 뜻을 연결“몰”의 초기화면 또는
                            연결되는 시점의 팝업화면으로 명시한 경우에는 그
                            거래에 대한 보증 책임을 지지 않습니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_22" class="agree_section">
                      <div class="sec_tit">
                        제22조 저작권의 귀속 및 이용제한
                      </div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰“이 작성한 저작물에 대한 저작권 기타 지적재산권은
                            ”몰“에 귀속합니다.
                          </li>
                          <li>
                            이용자는 “몰”을 이용함으로써 얻은 정보 중 “몰”에게
                            지적재산권이 귀속된 정보를 “몰”의 사전 승낙 없이
                            복제, 송신, 출판, 배포, 방송 기타 방법에 의하여
                            영리목적으로 이용하거나 제3자에게 이용하게 하여서는
                            안됩니다.
                          </li>
                          <li>
                            “몰”은 약정에 따라 이용자에게 귀속된 저작권을
                            사용하는 경우 당해 이용자에게 통보하여야 합니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_23" class="agree_section">
                      <div class="sec_tit">제23조 분쟁해결</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰”은 이용자가 제기하는 정당한 의견이나 불만을
                            반영하고 그 피해를 보상처리하기 위하여
                            피해보상처리기구를 설치․운영합니다.
                          </li>
                          <li>
                            “몰”은 이용자로부터 제출되는 불만사항 및 의견은
                            우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가
                            곤란한 경우에는 이용자에게 그 사유와 처리일정을 즉시
                            통보해 드립니다.
                          </li>
                          <li>
                            “몰”과 이용자 간에 발생한 전자상거래 분쟁과 관련하여
                            이용자의 피해구제신청이 있는 경우에는 공정거래위원회
                            또는 시•도지사가 의뢰하는 분쟁조정기관의 조정에 따를
                            수 있습니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_24" class="agree_section">
                      <div class="sec_tit">제24조 재판권 및 준거법</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰”과 이용자 간에 발생한 전자상거래 분쟁에 관한
                            소송은 제소 당시의 이용자의 주소에 의하고, 주소가
                            없는 경우에는 거소를 관할하는 지방법원의 전속관할로
                            합니다. 다만, 제소 당시 이용자의 주소 또는 거소가
                            분명하지 않거나 외국 거주자의 경우에는
                            민사소송법상의 관할법원에 제기합니다.
                          </li>
                          <li>
                            “몰”과 이용자 간에 제기된 전자상거래 소송에는
                            한국법을 적용합니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_25" class="agree_section">
                      <div class="sec_tit">
                        제25조 카카오톡 알림톡 시행에 관한 내용
                      </div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            쇼핑몰은 회원가입, 주문안내, 배송안내 등 비광고성
                            정보를 카카오톡 알림톡으로 알려드리며, 만약 알림톡
                            수신이 불가능하거나 수신 차단하신 경우에는 일반
                            문자메시지로 보내드립니다.
                          </li>
                          <li>
                            카카오톡 알림톡을 통해 안내되는 정보를 와이파이가
                            아닌 이동통신망으로 이용할 경우, 알림톡 수신 중
                            데이터 요금이 발생할 수 있습니다.
                          </li>
                          <li>
                            카카오톡을 통해 발송되는 알림톡 수신을 원치 않으실
                            경우 반드시 알림톡을 차단하여 주시기 바랍니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_26" class="agree_section">
                      <div class="sec_tit">제 26조 적립금(마일리지)</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰”의 적립금 정책은 “몰” 회원에 대해서만 적용됩니다
                          </li>
                          <li>
                            “몰”은 회원이 상품의 구매, 상품평의 작성, 이벤트
                            참여 등 ‘몰’의 서비스를 이용하는 경우, "몰"의 정책에
                            따라 회원에게 적립금을 무상으로 부여할 수 있습니다.
                          </li>
                          <li>
                            회원은 ‘몰’ 서비스를 통하여 상품 구매 시
                            결제수단으로 사용할 수 있으며 ‘더나음’은 적립금의
                            적립기준, 사용방법, 사용기간 및 제한에 대한 사항을
                            사이트에 별도로 게시하거나 통지합니다. 적립금의
                            사용조건에 관한 사항은 ‘Eatzzy’ 의 정책에 따라
                            달라질 수 있습니다.
                          </li>
                          <li>
                            회원은 적립금을 제3자에게 또는 다른 아이디로 양도할
                            수 없으며, 유상으로 거래하거나 현금으로 전환할 수
                            없습니다.
                          </li>
                          <li>
                            회원이 부당 또는 부정하게 적립금을 취득하는 경우 “몰
                            ”은 이용자의 적립금 회수, 구매신청 취소, ID 삭제 및
                            형사고발 등 기타 조치를 취할 수 있습니다.
                          </li>
                          <li>적립금의 유효기간은 적립일로부터 730일입니다.</li>
                          <li>
                            다음 각 호에 해당하는 경우 해당 적립금이 소멸됩니다.
                            <ul class="circlednum_type">
                              <li>① 적립금의 유효기간이 경과하는 경우</li>
                              <li>② ‘몰’ 회원 탈퇴하는 경우</li>
                              <li>③ ‘몰’ 회원 자격을 상실하는 경우</li>
                            </ul>
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_27" class="agree_section">
                      <div class="sec_tit">제 27조 할인쿠폰</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            할인쿠폰은 “몰”이 무상으로 발행하는 쿠폰으로,
                            발행대상, 발행경로, 사용대상 등에 따라 구분될 수
                            있으며, 할인쿠폰의 세부구분, 할인금액(할인율),
                            사용방법, 사용기한 및 제한에 대한 사항은 할인쿠폰
                            또는 서비스화면에 표시됩니다. 할인쿠폰의 종류 및
                            내용과 발급여부에 관하여는 “몰”의 정책에 따라 달라질
                            수 있습니다.
                          </li>
                          <li>
                            할인쿠폰은 현금으로 출금될 수 없으며, 할인쿠폰에
                            표시된 유효기간이 만료되거나 이용계약이 종료되면
                            소멸합니다.
                          </li>
                          <li>
                            할인쿠폰은 “몰”이 별도로 명시한 경우를 제외하고는
                            타인에게 양도할 수 없으며, 부정한 목적이나 용도로
                            사용할 수 없습니다. 이를 위반한 경우 “몰”은
                            할인쿠폰을 소멸시키거나 회원자격을 정지할 수
                            있습니다.
                          </li>
                          <li>
                            이용자가 부정한 방법으로 할인쿠폰을 획득한 사실이
                            확인될 경우 “몰”는 이용자의 할인쿠폰 회수, ID 삭제
                            및 형사고발 등 기타 조치를 취할 수 있습니다.
                          </li>
                          <li>
                            회원 탈퇴 시 ‘몰’로부터 발급받은 미사용 할인쿠폰은
                            즉시 소멸되며, 탈퇴 후 재가입 하더라도 소멸된
                            할인쿠폰은 복구되지 아니합니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_28" class="agree_section">
                      <div class="sec_tit">제 28조 면책조항</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰”은 천재지변 또는 이에 준하는 불가항력으로 인하여
                            서비스를 제공할 수 없는 경우에는 서비스 제공에 관한
                            책임이 면제됩니다.
                          </li>
                          <li>
                            “몰”은 회원의 귀책사유로 인한 서비스 이용의 장애에
                            대하여 책임을 지지 않습니다.
                          </li>
                          <li>
                            “몰”은 회원이 서비스를 이용하여 기대하는 수익을
                            상실한 것에 대하여 책임을 지지 않으며, 그 밖의
                            서비스를 통하여 얻은 자료로 인한 손해에 관하여
                            책임을 지지 않습니다.
                          </li>
                          <li>
                            “몰”은 회원이 게재한 정보, 자료, 사실의 신뢰도,
                            정확성 등 내용에 관해서는 책임을 지지 않습니다.
                          </li>
                          <li>
                            “몰”은 회원 간 또는 회원과 제3자 상호간에 서비스를
                            매개로 하여 거래 등을 한 경우에는 책임을 지지
                            않습니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <div id="ag_29" class="agree_section">
                      <div class="sec_tit">제 29조 위탁판매 금지조항</div>
                      <div class="sec_box">
                        <ol class="sec_txt">
                          <li>
                            “몰”의 사업자회원은 실제 매장을 운영하시거나 대량의
                            식자재를 필요로 하시는 사업자 분들께서 오프라인
                            매장에서 사용하실 수 있도록 도매가를 제공하고
                            있습니다.
                          </li>
                          <li>
                            따라서 온라인 구매대행 및 재판매의 경우, “몰”의 모든
                            이미지를 사용하여 판매하는 행위는 금지합니다.
                          </li>
                          <li>
                            구매대행 확인시에는 일반회원으로 강등조치 될 수
                            있습니다.
                          </li>
                        </ol>
                      </div>
                    </div>
                    <br />
                    <div class="agree_la_tit">
                      <p>
                        부 칙(시행일) 이 약관은 2014년 4월 1일부터
                        시행합니다.<br />이 약관은 2023 년 05 월 17 일부터
                        시행하며 종전의 약관은 이 약관으로 대체 합니다.
                      </p>
                    </div>
                  </div>
                </div>
                <!-- //agreement_box -->
              </div>
              <!-- //join_agreement_box -->

              <div class="join_agreement_box js_terms_view">
                <div class="form_element">
                  <input
                    type="checkbox"
                    id="termsAgree2"
                    name="privateApprovalFl"
                    class="require"
                    v-model="checkedItems.termsAgree2"
                  />
                  <label class="check_s" for="termsAgree2"
                    >개인정보 수집 및 이용 <strong>(필수)</strong></label
                  >
                </div>
                <div class="agreement_box" id="privateApproval_box">
                  <br />
                  <table>
                    <thead>
                      <tr>
                        <th>수집목적</th>
                        <th>수집항목</th>
                        <th>수집보유기간</th>
                      </tr>
                    </thead>
                    <tbody>
                      <tr>
                        <td>
                          회원가입의사확인,이용자 식별 및 본인여부,계약이행 및
                          약관 변경등의 고지를 위한 연락, 민원등의 고객
                          고충처리, 부정이용방지, 비인가사용방지 및 서비스 제공
                          및 계약의 이행, 서비스이용 및 상담,문의,후기 등 원활한
                          의사소통 경로 확보
                        </td>
                        <td>이름,아이디,비밀번호,휴대폰번호,이메일</td>
                        <td>
                          회원탈퇴 즉시 파기<br />부정이용방지를 위하여1년동안
                          보관(아이디,휴대폰번호)후 파기
                        </td>
                      </tr>
                      <tr>
                        <td>
                          서비스방문 및 이용기록 분석, 부정이용 방지 등을 위한
                          기록관리
                        </td>
                        <td>
                          서비스 이용기록, IP주소, 쿠키, 모바일 기기정보(앱
                          버전, OS 버전)
                        </td>
                        <td>회원 탈퇴 즉시 또는 이용 목적 달성 즉시 파기</td>
                      </tr>
                    </tbody>
                  </table>
                  ※ 단, 회원 탈퇴와 별개로 분쟁 조정, 고객문의 대응 및 법령 준수
                  이력 증빙을 위하여 이메일, 문자, 알림톡 발송이력은
                  발송일로부터 1년 보관(이름, 아이디, 휴대폰 번호, 이메일) 후
                  파기합니다.<br />※ 서비스 제공을 위해서 필요한 최소한의
                  개인정보입니다. 동의를 해 주셔야 서비스를 이용하실 수 있으며,
                  동의하지 않으실 경우 서비스에 제한이 있을 수 있습니다.
                </div>
                <!-- //agreement_box -->
              </div>
              <!-- //join_agreement_box -->
            </div>
            <div class="agree_right">
              <div class="join_agreement_box js_terms_view">
                <div class="form_element">
                  <input
                    type="checkbox"
                    id="termsAgree3"
                    name="termsAgree3"
                    class="require"
                    v-model="checkedItems.termsAgree3"
                  />
                  <label class="check_s" for="termsAgree3"
                    >위탁판매 약관 <strong>(필수)</strong></label
                  >
                </div>
                <div class="agreement_box" id="consignment_sales_box">
                  Eatzzy 사업자회원은 실제 매장을 운영하시거나 대량의 식자재를
                  필요로 하시는 사업자 분들께서 오프라인 매장에서 사용하실 수
                  있도록 도매가를 제공하고 있습니다.<br /><br />
                  온라인 재판매의 경우 제품의 안전성을 보장 할 수 없기 때문에
                  온라인 판매 및 이미지 사용은 제한합니다.
                </div>
              </div>
            </div>
            <div class="agree_right">
              <!--  -->
              <div class="join_agreement_box js_terms_view">
                <div class="form_element" style="border-bottom: none">
                  <input
                    type="checkbox"
                    id="termsAgree4"
                    name=""
                    v-model="checkedItems.termsAgree4"
                  />
                  <label class="check_s" for="termsAgree4"
                    >쇼핑정보 수집 및 이용
                    <strong class="choice" style="color: #222"
                      >(선택)</strong
                    ></label
                  >
                </div>
                <div class="agreement_choice_box" id="choice_box" style="">
                  <!--  -->
                  <table
                    summary="(선택)개인정보 수집 및 이용 내용입니다."
                    border="0"
                    cellpadding="0"
                    cellspacing="0"
                  >
                    <colgroup>
                      <col width="50px" />
                      <col width="260px" />
                    </colgroup>
                    <thead>
                      <tr>
                        <th>선택</th>
                        <th>쇼핑정보 수신 동의</th>
                      </tr>
                    </thead>
                    <tbody>
                      <tr>
                        <td>
                          <div class="form_element">
                            <input
                              type="checkbox"
                              id="termsAgree5"
                              name="termsAgree5"
                              v-model="checkedItems.termsAgree5"
                            />
                            <label class="check_s" for="termsAgree5"
                              >선택</label
                            >
                          </div>
                        </td>
                        <td>
                          1. 할인쿠폰 및 혜택, 이벤트, 신상품 소식 등 쇼핑몰에서
                          제공하는 유익한 쇼핑정보를 SMS와 이메일로 받아보실 수
                          있습니다.<br />
                          단, 주문/거래정보 및 주요 정책과 관련된 내용은
                          수신동의 여부와 관계없이 카카오톡 알림 또는 SMS로
                          발송됩니다.<br />
                          <br />
                          2. 선택 약관에 동의하지 않으셔도 회원가입은 가능하며,
                          회원가입 후 회원정보수정 페이지에서 언제든지
                          수신여부를 변경하실 수 있습니다.
                        </td>
                      </tr>
                    </tbody>
                  </table>
                  <!--  -->
                  <table
                    summary="(선택)개인정보 수집 및 이용 내용입니다."
                    border="0"
                    cellpadding="0"
                    cellspacing="0"
                  >
                    <colgroup>
                      <col width="50px" />
                      <col width="260px" />
                    </colgroup>
                    <thead>
                      <tr>
                        <th>선택</th>
                        <th>선택정보 수집 및 이용동의</th>
                      </tr>
                    </thead>
                    <tbody>
                      <tr>
                        <td>
                          <div class="form_element">
                            <input
                              type="checkbox"
                              id="termsAgree6"
                              name="termsAgree6"
                              v-model="checkedItems.termsAgree6"
                            />
                            <label class="check_s" for="termsAgree6"
                              >선택</label
                            >
                          </div>
                        </td>
                        <td>
                          선택정보 수집<br />
                          목적: 쇼핑 물품배송 및 배송관련 민원처리<br />
                          항목: 전화번호, 주소<br />
                          보유기간: 회원탈퇴 후 5일까지 또는 전자상거래 등 관련
                          법령에 다른 보유기간까지
                        </td>
                      </tr>
                    </tbody>
                  </table>
                  <!--  -->
                </div>
              </div>
              <!--  -->
              <!-- //join_agreement_box -->
            </div>

            <div class="important_check_box">
              <strong class="important_check dn"
                >이용약관과 개인정보 수집 및 이용에 대한 안내 모두
                동의해주세요.</strong
              >
            </div>
          </div>
          <!-- //join_agreement_cont -->
          <!-- //join_certify_box -->

          <div class="btn_center_box">
            <button type="button" @click="btnPrevStep" class="btn_member_prev">
              이전단계
            </button>
            <button type="button" @click="btnNextStep" class="btn_member_next">
              다음단계
            </button>
          </div>
          <!-- //btn_member_sec -->
        </div>
      </div>
    </div>
  </div>
</template>
<style scoped>
.container .main {
  width: 50%;
  min-width: 37.5rem;
  margin: 0 auto;
}

.location_wrap {
  position: relative;
  width: 100%;
}

.location_wrap .location_cont {
  width: 100%;
  margin: 0;
  text-align: right;
}

.location_cont em {
  display: inline-block;
  padding: 0.75rem 0 0.625rem 0;
  color: #777777;
  font-size: 0.7813rem;
}

.location_cont .local_home {
  color: #777777;
}

.location_wrap .location_cont:after {
  display: block;
  clear: both;
  content: "";
}

.member_tit {
  overflow: hidden;
  border-bottom: 0.0625rem solid #e0e0e0;
  display: flex;
  justify-content: flex-end;
}

.member_tit ol {
  line-height: 2.1875rem;
  display: flex;
  column-gap: 0.625rem;
}

.member_tit ol li {
  font-size: 0.875rem;
  color: #d1d1d1;
  display: flex;
  align-items: center;
  column-gap: 0.625rem;
}

.member_tit .page_on {
  color: var(--point-color);
}

.member_tit2 {
  width: 100%;
  text-align: center;
  margin: 2rem 0;
  display: inline-block;
}

.member_tit2 p {
  font-size: 3.125rem;
  color: #222222;
  letter-spacing: -0.05em;
  line-height: 1;
}

.txt_mainco {
  color: var(--point-color) !important;
}

.member_cont {
  border: none;
}

.join_agreement_cont {
  padding: 0 0 2.5rem 0;
}

.agree_all {
  background: #eee;
  padding: 0.9375rem 0 0.625rem 2.5rem;
  cursor: pointer;
  text-align: left;
}

.form_element em {
  font-weight: 400;
  cursor: pointer;
  font-size: 1rem;
  line-height: 1.5625rem;
  margin-left: 0.4375rem;
}

.form_element span {
  font-size: 0.875rem;
  display: block;
  text-align: left;
  text-indent: 2.125rem;
}

.agreement_box {
  overflow-x: hidden;
  overflow-y: auto;
  height: 11.8125rem;
  padding: 1.25rem;
  border: 0.0625rem solid #c9c9c9;
  border-top: none !important;
  line-height: 1.125rem;
  margin-bottom: 0.3125rem;
  width: 100%;
  box-sizing: border-box;
}

.join_agreebox_wrap {
  border: 0.0625rem solid #c9c9c9;
  border-top: none !important;
  padding: 1.1875rem 2.5rem 1.375rem 2.5rem;
  display: inline-block;
  width: 100%;
  box-sizing: border-box;
}

.join_agreebox_wrap .agree_left {
  float: left;
  width: 100%;
  display: block;
}

.join_certify_list .form_element {
  font-size: 1.125rem;
}
.join_certify_list .form_element p {
  font-size: 0.9375rem;
  text-align: left;
  padding-left: 1.75rem;
}

.join_agreebox_wrap .form_element {
  border-bottom: 0.0625rem solid #c9c9c9;
  font-size: 1rem;
  font-weight: 300;
  letter-spacing: -0.02em;
  height: 3.8125rem;
  width: 100%;
  line-height: 3.5625rem;
  display: inline-block;
}

.join_agreebox_wrap .form_element label.check_s {
  background-position: 0.0625rem 1.2813rem;
}
.join_agreebox_wrap .form_element strong {
  font-weight: 400;
}

.join_agreebox_wrap .form_element span > a {
  border: 0.0625rem solid #c9c9c9;
  border-radius: 0.3125rem;
  width: 5.0625rem;
  height: 1.8125rem;
  padding: 0.375rem 0.625rem 0.375rem 0.625rem;
  margin: 0.9375rem 0.6875rem 0 0;
  font-size: 0.875rem;
  color: #222;
  text-decoration: none !important;
}

.join_agreement_cont .agreement_choice_box .form_element {
  border-bottom: none;
  text-align: inherit;
}

.join_agreebox_wrap .form_element .agreenment_toggle_btn {
  background: url("/src/assets/icons/join_chosen_sprite.png")
    no-repeat 0.4375rem 0.4375rem;
  border: 0.0625rem solid #c9c9c9;
  border-radius: 0.3125rem;
  width: 1.8125rem;
  height: 1.8125rem;
  padding: 0;
  margin: 0.9375rem 0 0 0;
  cursor: pointer;
}

.join_agreement_box table {
  width: 100%;
}

.join_agreement_box table th {
  padding: 1.25rem 0;
  border-left: 0.0625rem solid #dcdcdc;
  background: #fbfbfb;
}

.join_agreement_box table th:first-child,
.join_agreement_box table td:first-child {
  border-left: none;
}

.join_agreement_box table td {
  padding: 1.25rem 0 1.25rem 0.625rem;
  border-top: 0.0625rem solid #dcdcdc;
  border-left: 0.0625rem solid #dcdcdc;
  border-bottom: 0.0625rem solid #dcdcdc;
}

.join_agreement_cont .agreement_choice_box table {
  width: 100%;
}

.join_agreement_cont .agreement_choice_box table th {
  padding: 1.25rem 0;
  border-left: 0.0625rem solid #dcdcdc;
  background: #fbfbfb;
}

.join_agreement_cont .agreement_choice_box table th:first-child,
.join_agreement_cont .agreement_choice_box table td:first-child {
  border-left: none;
  min-width: 3.125rem;
}

.join_agreement_cont .agreement_choice_box table td {
  padding: 1.25rem 0 1.25rem 0.625rem;
  border-top: 0.0625rem solid #dcdcdc;
  border-left: 0.0625rem solid #dcdcdc;
  border-bottom: 0.0625rem solid #dcdcdc;
}

.join_certify_box {
  margin: 1.875rem 0 0 0;
}

.join_certify_box h3 {
  font-weight: bold;
  padding: 0 0 0.5625rem 0;
  font-size: 1.5rem;
  text-align: center;
}

.join_certify_list {
  padding: 1.875rem 0;
  border: 0.0625rem solid #c9c9c9;
}

.join_certify_list ul {
  text-align: center;
}

.join_certify_list li {
  display: inline-block;
}

.join_certify_list .phone_join_certify {
  display: flex;
  justify-content: center;
  align-items: center;
  column-gap: 30px;
}

.join_certify_list .phone_join_certify .form_element {
  text-align: left;
}

.join_certify_list .phone_join_certify li {
  display: flex;
}

.join_certify_list .form_element label.choice_s {
  padding: 0 0 0 1.75rem;
  background: url("/src/assets/icons/radio_off_small.png")
    no-repeat 0.0625rem 50%;
}

.btn_member_prev {
  font-size: 18px;
  font-weight: 400;
  width: 216px;
  height: 51px;
  margin: 0;
  color: var(--point-color);
  border: 1px solid var(--point-color);
  background: #ffffff;
  cursor: pointer;
}

.btn_center_box {
  margin: 35px 0 0 0;
  display: flex;
  justify-content: center;
  column-gap: 5px;
}

.btn_member_next {
  font-size: 18px;
  font-weight: 400;
  width: 216px;
  height: 51px;
  margin: 0;
  border: 1px solid var(--point-color);
  background: var(--point-color);
  cursor: pointer;
  color: #fff;
}

@media (max-width: 600px) {
  .main {
    width: 90% !important;
    min-width: unset !important;
  }
}
</style>
